# XML exercise

Using data from [**mondial database**](https://drive.google.com/file/d/14lFT4nWHgwN36ij4XZh6OUuup-K9qLgR/view?usp=sharing) find the answers to following questions:

1. 10 countries with the lowest infant mortality rates
2. 10 cities with the largest population
3. name and country of a) longest river, b) largest lake and c) airport at highest elevation

In [1]:
import xml.etree.ElementTree as ET
tree = ET.parse('mondial.xml')
root = tree.getroot()
root

In [27]:
root[1].tag

'country'

In [28]:
root[0].find('infant_mortality')

In [52]:
mortalityByCountry = {
    'country': [],
    'infantMorality': []
    }   
for country in root.iter('country'):
    if country.find('infant_mortality') is None:
        continue
    else:
        mortalityByCountry['infantMorality'].append(float(country.find('infant_mortality').text))
        mortalityByCountry['country'].append(country.find('name').text)

In [53]:
df_mortalityByCountry = pd.DataFrame(mortalityByCountry)
df_mortalityByCountry.head()

           country  infantMorality
0          Albania           13.19
1           Greece            4.78
2  North Macedonia            7.90
3           Serbia            6.16
4          Andorra            3.69

In [60]:
df_mortalityByCountry.sort_values(by='infantMorality').head(10)

            country  infantMorality
36           Monaco            1.81
90            Japan            2.13
109         Bermuda            2.48
34           Norway            2.48
98        Singapore            2.53
35           Sweden            2.60
8    Czech Republic            2.63
6             Spain            2.70
72        Hong Kong            2.73
73            Macao            3.13

In [65]:
df_mortalityByCountry.nsmallest(10, 'infantMorality', keep='all')

            country  infantMorality
36           Monaco            1.81
90            Japan            2.13
34           Norway            2.48
109         Bermuda            2.48
98        Singapore            2.53
35           Sweden            2.60
8    Czech Republic            2.63
6             Spain            2.70
72        Hong Kong            2.73
73            Macao            3.13

# 2. 10 cities with the largest population

# 3. name and country of a) longest river

# 3. name and country of largest lake

# 3. name and country of airport at highest elevation

In [ ]:
from numpy import NaN


for airport in root.iter('airport'):
    print(airport.find('elevation') is not None)

In [ ]:
root.findall('./airport')

In [79]:
countries = {
    'countryName': [],
    'countryCode': []
    }    
for country in root.iter('country'):
    countries['countryName'].append(country.find('name').text) 
    countries['countryCode'].append(country.get('car_code'))
sorted(countries['countryCode'])[0:10]

['A', 'AFG', 'AG', 'AL', 'AMSA', 'AND', 'ANG', 'ARM', 'ARU', 'AUS']

In [81]:
df3a2 = pd.DataFrame(countries)
df3a2.head()

       countryName countryCode
0          Albania          AL
1           Greece          GR
2  North Macedonia          MK
3           Serbia         SRB
4       Montenegro         MNE

In [137]:
airports = {
    'airportCountry': [],
    'airport': [],
    'elevation': []
    }   
for airport in root.iter('airport'):
    if airport.find('elevation') is not None:
        airports['airportCountry'].append(airport.get('country'))
        airports['airport'].append(airport.find('name').text)
        airports['elevation'].append(float(airport.find('elevation').text))
    else:
        continue
    # elif airport.find('elevation').text == None:
    #     continue

df3a1 = pd.DataFrame.from_dict(airports)
df3a1.head()

  airportCountry               airport  elevation
0            AFG                 Herat      977.0
1            AFG            Kabul Intl     1792.0
2             AL          Tirana Rinas       38.0
3             DZ  Cheikh Larbi Tebessi      811.0
4             DZ         Batna Airport      822.0

In [141]:
df3a1.merge(df3a2,left_on='airportCountry',right_on='countryCode').sort_values(by='elevation',ascending=False)

,airportCountry,airport,elevation,countryName,countryCode
81,BOL,El Alto Intl,4063.0,Bolivia,BOL
216,CN,Lhasa-Gonggar,4005.0,China,CN
233,CN,Yushu Batang,3963.0,China,CN
790,PE,Juliaca,3827.0,Peru,PE
792,PE,Teniente Alejandro Velasco Astete Intl,3311.0,Peru,PE
...,...,...,...,...,...
320,ET,Alexandria Intl,-2.0,Egypt,ET
723,NL,Schiphol,-3.0,Netherlands,NL
720,NL,Rotterdam,-5.0,Netherlands,NL
874,R,Astrakhan,-20.0,Russia,R
592,KAZ,Atyrau,-22.0,Kazakhstan,KAZ